         select optional sections-db assign to external 'sections.dat'
           organization is indexed
           access mode is dynamic
           record key is name
           lock mode is automatic
           sharing with all other.
