         fd sections-db is external.
         01 ssection.
           02 name picture x(20).
           02 api-keys occurs 9 times.
             03 api-key picture x(40).
           02 api-keys-count picture 9.
