         fd settings-db is external.
         01 setting-record.
           02 composite-key.
             03 ssection-name picture x(40).
             03 sparam-name picture x(40).
           02 sparam-value picture x(87).
