         select optional settings-db assign to external 'settings.dat'
           organization is indexed
           access mode is dynamic
           record key is composite-key
           lock mode is automatic
           sharing with all other.
